import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

salary = pd.Series([4300, 8370, 1750, 3830, 1840, 4220, 3020, 2290, 4740, 4600, 
                    2860, 3400, 4800, 4470, 2440, 4530, 4850, 4850, 4760, 4500, 
                    4640, 3000, 1880, 4880, 2240, 4750, 2750, 2810, 3100, 4290, 
                    1540, 2870, 1780, 4670, 4150, 2010, 3580, 1610, 2930, 4300, 
                    2740, 1680, 3490, 4350, 1680, 6420, 8740, 8980, 9080, 3990, 
                    4960, 3700, 9600, 9330, 5600, 4100, 1770, 8280, 3120, 1950, 
                    4210, 2020, 3820, 3170, 6330, 2570, 6940, 8610, 5060, 6370,
                    9080, 3760, 8060, 2500, 4660, 1770, 9220, 3380, 2490, 3450, 
                    1960, 7210, 5810, 9450, 8910, 3470, 7350, 8410, 7520, 9610, 
                    5150, 2630, 5610, 2750, 7050, 3350, 9450, 7140, 4170, 3090])

salary.hist()
plt.show()

bins = [0, 2000, 4000, 6000, 8000, 10000] # 범위 지정을 위해 분할 단위가 모여있는 리스트
ctg = pd.cut(salary, bins=bins) # bins에 따라 salary를 분할
#print(ctg)
#print('salary[0]:', salary[0])
#print('salary[0]가 속한 카테고리:', ctg[0])

#print(ctg.value_counts().sort_index()) # ctg 밸류의 갯수를 인덱스별로 sort
ctg = pd.cut(salary, bins=6) # 리스트 대신에 정수를 입력하면 전체에서 정수갯수만큼 범위를 나눔(최소~최대)
#print(ctg)

print(ctg.value_counts().sort_index()) # ctg 밸류의 갯수를 인덱스별로 sort
ctg = pd.qcut(salary, q=5) # qcut은 구간이 아니라 비슷한 크기의 그룹으로 묶어줌??
#print(ctg)
print(ctg.value_counts().sort_index()) # 나눈 갯수만큼 갯수가 똑같다.
# bins = list : 리스트 내부 값에 따라 나눔, bins = num : num 만큼 최솟값에서 최댓값을 나눠서 분리 - 범위마다 갯수가 다를 수 있음
# q = num, num만큼 갯수를 나눔 ex) 12개의 data에서 3을 넣으면 4,4,4 
